/*
Тема: Программирование линейных алгоритмов
Задача: Написать программу вычисления линейного арифметического выражения
Вариант: 13
Выполнил: Цидик Павел, группа 520601
*/

#include <iostream> // Подключение библиотеки ввода / вывода
#include <cmath> // Подключение библиотеки математических функций

using namespace std; // Использование пространства имен std

int main() { // Базовая функция программы
    double x, y, z, answer, numerator, denominatorOne, denominatorTwo; // Выделение памяти под переменные

    // Ввод данных
    cout << "Введите x: ";
    cin >> x;
    cout << "Введите y: ";
    cin >> y;
    cout << "Введите z: ";
    cin >> z;

    // Нахождение значения выражения
    numerator = pow(y + pow(x - 1, 1. / 3.), 1. / 4.); // Вычисление числителя
    denominatorOne = fabs(x - y); // Вычисление первой части знаменателя
    denominatorTwo = pow(sin(z), 2) + tan(z); // Вычисление второй части знаменателя
    answer = numerator / (denominatorOne * denominatorTwo); // Вычисление ответа

    cout << "Значение выражения: " << answer << endl; // Вывод результата с очищением буфера вывода

    return 0;
}
